app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("firstname", "lastname", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "Ryan"], ["lastname", "Lacerna"], ["title", "my title"], ["content", "Lorem Ipsum"], ["created_at", "2015-04-28 18:30:48.722879"], ["updated_at", "2015-04-28 18:30:48.722879"]]